int/resources/objectRepo/xmlTemplates/ows/OWSReservation/req_UpdateInventoryItem.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:core="http://webservices.micros.com/og/4.3/Core/" xmlns:hot="http://webservices.micros.com/og/4.3/HotelCommon/" xmlns:res="http://webservices.micros.com/ows/5.1/Reservation.wsdl">
   <soapenv:Header>
      <core:OGHeader authToken="?" channelValidation="true" primaryLangID="E" terminalID="?" timeStamp="?" transactionID="?">
         <core:Origin entityID="?" organizationID="?" systemType="?"/>
         <core:Destination entityID="?" organizationID="?" systemType="?"/>
         <core:Intermediaries>
            <core:EndPoint entityID="?" organizationID="?" systemType="?"/>
         </core:Intermediaries>
         <core:Authentication>
            <core:UserCredentials>
               <core:UserName/>
               <core:UserPassword/>
               <core:Domain/>
               <core:SecurityId/>
            </core:UserCredentials>
            <core:Licence>
               <core:Key/>
            </core:Licence>
         </core:Authentication>
      </core:OGHeader>
   </soapenv:Header>
   <soapenv:Body>
      <res:UpdateInventoryItemRequest>
         <res:HotelReference chainCode="?" hotelCode="?"/>
         <res:ConfirmationNumber source="?" type="?"/>
         <res:LegNumber source="?" type="?"/>
         <res:ResvNameId source="?" type="?"/>
         <res:ItemCode/>
         <res:ItemGroup/>
         <res:Quantity/>
         <res:StayDateRange>
            <hot:StartDate/>
            <hot:EndDate/>
            <hot:Duration/>
         </res:StayDateRange>
         <res:DaysOfWeek/>
      </res:UpdateInventoryItemRequest>
   </soapenv:Body>
</soapenv:Envelope>